app/controllers/product_categories_controller.rb

SELECT * FROM "product_categories"
---
  def index
    @product_categories = ProductCategory.all

SELECT * FROM "product_categories" WHERE ("product_categories"."id" = 1)
---
  def show
    @product_category = ProductCategory.find(params[:id])

SELECT * FROM "product_categories" WHERE ("product_categories"."id" = 1)
---
  def edit
    @product_category = ProductCategory.find(params[:id])

INSERT INTO "product_categories" ("updated_at", "product_id", "category_id", "created_at") VALUES('2010-04-06 02:26:55', 1, 1, '2010-04-06 02:26:55')
---
  def create
    @product_category = ProductCategory.new(params[:product_category])

    respond_to do |format|
      if @product_category.save

SELECT * FROM "product_categories" WHERE ("product_categories"."id" = 1)
UPDATE "product_categories" SET "category_id" = 3, "product_id" = 1, "updated_at" = '2010-04-14 01:30:18' WHERE "id" = 3
---
  def update
    @product_category = ProductCategory.find(params[:id])

    respond_to do |format|
      if @product_category.update_attributes(params[:product_category])

SELECT * FROM "product_categories" WHERE ("product_categories"."id" = 3)
DELETE FROM "product_categories" WHERE "id" = 3
---
  def destroy
    @product_category = ProductCategory.find(params[:id])
    @product_category.destroy